In [1]:
import numpy as np
import pandas as pd

In [3]:
data = pd.read_csv('./datasets/titanic.csv', index_col='PassengerId')
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Какое количество мужчин и женщин ехало на корабле?

In [40]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

### Какой части пассажиров удалось выжить? Посчитайте долю выживших пассажиров.

In [41]:
data['Survived'].value_counts()/len(data['Survived'])*100

0    61.616162
1    38.383838
Name: Survived, dtype: float64

In [42]:
(data['Survived'].value_counts()/len(data['Survived'])*100)[1:2] #-выжили

1    38.383838
Name: Survived, dtype: float64

### Какую долю пассажиры первого класса составляли среди всех пассажиров? Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен).

In [43]:
data['Pclass'].value_counts()/len(data['Pclass'])*100

3    55.106622
1    24.242424
2    20.650954
Name: Pclass, dtype: float64

In [44]:
(data['Pclass'].value_counts()/len(data['Pclass'])*100)[1:2] # - пассажиры первого класса

1    24.242424
Name: Pclass, dtype: float64

### Какого возраста были пассажиры? Посчитайте среднее и медиану возраста пассажиров.

In [45]:
data['Age'].mean() #среднее

29.69911764705882

In [46]:
data['Age'].median()

28.0

### Коррелируют ли число братьев/сестер/супругов с числом родителей/детей? Посчитайте корреляцию Пирсона между признаками SibSp и Parch.

In [47]:
data1=data[['SibSp','Parch']]

In [48]:
correlation=data1.corr(method='pearson')
correlation

          SibSp     Parch
SibSp  1.000000  0.414838
Parch  0.414838  1.000000

### Какое самое популярное женское имя на корабле? Извлеките из полного имени пассажира (колонка Name) его личное имя (First Name). Это задание — типичный пример того, с чем сталкивается специалист по анализу данных. Данные очень разнородные и шумные, но из них требуется извлечь необходимую информацию. Попробуйте вручную разобрать несколько значений столбца Name и выработать правило для извлечения имен, а также разделения их на женские и мужские.

In [49]:
data=data[data['Name'].str.contains('Mrs') | data['Name'].str.contains('Miss') |data['Name'].str.contains('Ms')][['Name']]
for i in data['Name']:
    k=0
    for j in i:
        if j==',':
            #print(i[:k]) # - 
            data[data.Name==i]=i[:k]
            #print(data[data.Name==i].FirstName)
            #print(i[k+2:k+5]) # - ж. или м.
            break
        else:
            k+=1
    #print(k)
    #print(data['Name'][:k],k)
data.head()

                  Name
PassengerId
2              Cumings
3            Heikkinen
4             Futrelle
9              Johnson
10              Nasser

In [50]:
data.groupby('Name').size().sort_values(ascending=False)
name=data.groupby('Name').size().sort_values(ascending=False).head(1)
name

Name
Andersson    6
dtype: int64

In [51]:
data

                       Name
PassengerId
2                   Cumings
3                 Heikkinen
4                  Futrelle
9                   Johnson
10                   Nasser
11                Sandstrom
12                  Bonnell
15                  Vestrom
16                  Hewlett
19            Vander Planke
20               Masselmani
23                  McGowan
25                  Palsson
26                  Asplund
29                  O'Dwyer
32                  Spencer
33                    Glynn
39            Vander Planke
40            Nicola-Yarred
41                    Ahlin
42                   Turpin
44                  Laroche
45                  Devaney
48               O'Driscoll
50           Arnold-Franchi
53                   Harper
54               Faunthorpe
57                     Rugg
59                     West
62                    Icard
...                     ...
808              Pettersson
810                Chambers
814               Andersson
817                Heininen
821                    Hays
824                    Moor
830                   Stone
831                 Yasbeck
836                 Compton
843                Serepeca
850              Goldenberg
853                  Boulos
854                   Lines
855                  Carter
856                     Aks
857                    Wick
859                 Baclini
863                   Swift
864                    Sage
866                 Bystrom
867            Duran y More
872                Beckwith
875                 Abelson
876                   Najib
880                  Potter
881                 Shelley
883                Dahlberg
886                    Rice
888                  Graham
889                Johnston

[310 rows x 1 columns]